#include <stdio.h>

int main()
{
	printf("(주)킹마트\n");
	printf("사업자번호 : %s\n", "286-81-01771");
	printf("대  표  자 : %s\n", "김현주");
	printf("주      소 : %s\n", "경기 고양시 일산서구 중앙로1391 \n레이크타운 지하1층\n");
	printf("전 화 번호 : %s\n", "031-916-9200\n");
	printf("킹마트를 찾아주셔서 감사합니다.\n");
	printf("판매일: %s, %s 계산대: %s\n", "20-09-26 18:14", "토요일", "002");
	printf("-------------------------------------------\n");
	printf("%3s %7s \t%8s  %-7s    %-7s \n","NO.", "상품명", "단가", "수량", "금액");
	printf("-------------------------------------------\n");
	printf("%3s %7s %5s\n    %10s  %5d   %3d      %5d \n", "001", "공주알밤술", "750ml", "8809409970097", 1300, 2, 2600);
	printf("%3s %7s %5s\n    %10s  %5d   %3d      %5d \n" , "002", "웰치소다포도", "1.5L", "8801043034722", 1980, 1, 1980);
	printf("%3s %7s %5s\n    %-14s %5d   %3d      %5d # \n", "003", "상추 1봉", "", "22001429", 1980, 1, 1980);
	printf("%3s %7s %5s\n    %10s  %5d   %3d      %5d \n", "004", "팔도)비빔면멀티팩 5입", "", "8801128503051", 3980, 1, 3980);
	printf("-------------------------------------------\n");
	printf("(#) 면세물품 : \t\t\t     %4d \n", 1980);
	printf("과 세  물 품 : \t\t\t     %4d \n", 7782);
	printf("부가세(VAT)  : \t\t\t     %4d \n", 778);
	printf("합        계 : \t\t\t    %4d \n", 10540);
	printf("신용카드지불\n");
	return 0;
}

